In [7]:
import pandas as pd
import requests
import json
import numpy as np
from datetime import date

In [14]:
token = 'https://arquivos.b3.com.br/api/download/requestname?fileName=InstrumentsConsolidated&date={}&recaptchaToken='.format(today)
#token = 'https://arquivos.b3.com.br/api/download/requestname?fileName=InstrumentsConsolidated&date=2020-06-26&recaptchaToken='
r = requests.get(token)
vJson = json.loads(r.content)
vJson['token']
optionList = 'https://arquivos.b3.com.br/api/download/?token={}'.format(vJson['token'])
r1 = requests.get(optionList)

data = r1.content.decode("ISO-8859-1").splitlines()
df = pd.DataFrame(data) 
df1=df.copy()
df1.dropna(inplace = True) 
df1 = df1.applymap(str)
df1 = pd.DataFrame(df1)
df1 = df1[0].str.split(";", n = 100, expand = True)
df1.columns = df1.iloc[0]
df1 = df1[1:]
df1 = df1.reset_index()
df1.drop("index", axis = 1, inplace=True)

df2 = df1[["TckrSymb", "Asst", "SgmtNm", "SctyCtgyNm", "XprtnDt", "TradgEndDt", "OptnTp", "ExrcPric", "OptnStyle"]]
df2 = df2[df2['SctyCtgyNm']=='OPTION ON EQUITIES']
df2['ExrcPric'] = [x.replace(',', '.') for x in df2['ExrcPric']]
df2['ExrcPric'] = df2['ExrcPric'].astype(float)

In [98]:
vCot = pd.read_excel(open(r'C:\Users\kiyo_\OneDrive\Documentos\Macro.xlsm', 'rb'), sheet_name='Sheet1') 
vCot.drop("Asst", axis = 1, inplace=True)
vCot.columns = ["Ticker","Value"]

In [30]:
vCot

     Ticker  Value
0     ABEV3  14.20
1     ALPA4  28.91
2     ALSO3  27.49
3    ALUP11  23.84
4     ARZZ3  46.50
..      ...    ...
126   VVAR3  14.09
127   WEGE3  49.61
128   WIZS3  10.65
129  XBOV11  92.21
130   YDUQ3  32.52

[131 rows x 2 columns]

In [32]:
vCot1

     Asst Unnamed: 1  Unnamed: 2
0     NaN      ABEV3       14.20
1     NaN      ALPA4       28.91
2     NaN      ALSO3       27.49
3     NaN     ALUP11       23.84
4     NaN      ARZZ3       46.50
..    ...        ...         ...
126   NaN      VVAR3       14.09
127   NaN      WEGE3       49.61
128   NaN      WIZS3       10.65
129   NaN     XBOV11       92.21
130   NaN      YDUQ3       32.52

[131 rows x 3 columns]